<template>
  <div class="app">
    <h1 class="center">X01项目功能说明书</h1>

    <div class="content_wrapper">
      <div>文档说明:</div>
      <p class="MsoNormal">本说明分为用户部分、商户部分，测试部分</p>
      <p class="MsoNormal"><b>用户部分：</b><span>包括设备的扫码使用，预约，反馈等功能</span></p>
      <p class="MsoNormal"><b>商户部分：</b><span>包括运营商功能与管理员功能，定义运营商为购买格力共享设备，在本软件平台上注册通过，并经过平台认证为运营商的使用者；定义管理员为在本软件平台上注册，通过运营商自主验证的使用者。平台与运营商的的关系是一对多，运营商与管理员的关系是一对多。</span></p>
      <p class="MsoNormal"><b >测试部分：</b><span>因为整机取消了所有的按键，本部分为整机的某些功能测试，能效测试提供工具。针对的是测试人员，能够使得整机进入某些特殊的测试模式即可。<span style="color: crimson">本部分功能对用户不开放</span>，不要求对本部分进行测试</span></p>
    </div>

    <div class="menus">
      <div class="margin_10">目录</div>

      <a href="#version" class="margin_10">版本管理</a>

      <a href="" class="margin_10">公众号的关注</a>

      <a href="" class="margin_10">用户部分</a>

      <a href="" class="margin_20">1、扫码洗衣</a>

      <a href="" class="margin_30">1.1、功能简述</a>

      <a href="" class="margin_30">1.2、具体操作</a>

      <a href="" class="margin_20">2、预约洗衣</a>

      <a href="" class="margin_30">2.1、功能简述</a>

      <a href="" class="margin_30">2.2、具体操作</a>

      <a href="" class="margin_20">3、我的订单</a>

      <a href="" class="margin_30">3.1、功能简述</a>

      <a href="" class="margin_30">3.2、具体操作</a>

      <a href="" class="margin_20">4、消息提醒</a>

      <a href="" class="margin_20">5、用户反馈</a>

      <a href="" class="margin_10">商户部分</a>

      <a href="" class="margin_20">1、登录注册</a>

      <a href="" class="margin_30">1.1、登录</a>

      <a href="" class="margin_30">1.2、注册</a>

      <a href="" class="margin_30">1.3、运营商验证</a>

      <a href="" class="margin_30">1.4、管理员验证</a>

      <a href="" class="margin_30">1.5、忘记密码</a>

      <a href="" class="margin_20">2、运营商账号</a>

      <a href="" class="margin_30">2.1、运营商主页管理</a>

      <a href="" class="margin_30">2.2、运营商设备状态</a>

      <a href="" class="margin_30">2.3、运营商收入管理</a>

      <a href="" class="margin_30">2.4、运营商分店管理</a>

      <a href="" class="margin_30">2.5、指定支付标准</a>

      <a href="" class="margin_30">2.6、个人信息</a>

      <a href="" class="margin_30">2.7、消息中心</a>

      <a href="" class="margin_20">3、管理员账号</a>

      <a href="" class="margin_30">3.1、管理员主页管理</a>

      <a href="" class="margin_30">3.2、设备状态</a>

      <a href="" class="margin_30">3.3、洗衣点收入</a>

      <a href="" class="margin_30">3.4、洗衣点管理</a>

      <a href="" class="margin_30">3.5、洗衣机管理</a>

      <a href="" class="margin_30">3.6、个人中心</a>

      <a href="" class="margin_30">3.7、消息中心</a>

      <a href="" class="margin_10">测试部分</a>

      <a href="" class="margin_20">1、获取测试入口</a>

      <a href="" class="margin_20">2、新建测试权限</a>

      <a href="" class="margin_20">3、功能测试测试</a>
    </div>

    <a name="version"><h2>版本管理</h2></a>
    <table class="align-center" border="1" cellspacing="0" cellpadding="0" width=auto>
      <tbody>
        <Table-tr v-for="(item,index) in record" v-model="index" :key="index" :ttId="index" :ttVersion="item[0]" :ttLog="item[1]" :ttPeople="item[2]" :ttTimer="item[3]"></Table-tr>
      </tbody>
    </table>

    <div>
    公众号的关注
    使用该洗衣系统，首先需要关注微信公众号，有两种关注的方式。

    其一微信内搜索公众号"iCleaner"并关注，如图1-1所示


    图1-1
    图1-1
    其二使用微信软件的扫一扫，扫描洗衣机上的二维码，并按照跳转的网页上的
    提醒关注公众号。如图1-2所示

    图1-2
    图1-2
    关注公众号后进入公众号界面如图1-4，有三个菜单按键，分别是"立即洗衣"，"我的订单"与"菜单"。

    点击"立即洗衣"跳转到洗衣地图页面，可以进行扫码立即洗衣，以及预约洗衣的操作

    点击"我的订单"可以查询历史订单与正在进行中的订单

    "菜单"用户系统不需要进行使用，不需测试


    图1-3
    图1-3

    图1-4
    图1-4
    用户部分
    1、扫码洗衣
    1.1、功能简述
    用户在微信消息页点击立即洗衣，进入图2.1的地图页，在当前页面完成扫码洗衣。

    1.2、具体操作
    点击图1.2中"立即洗衣"，进入下图2.1。

    中间的红色图标表示用户定位到的当前位置，空洗衣点不显示

    假如附近（5Km）内没有洗衣房，界面上方显示一个黄色的提醒"附近无洗衣房数据"。

    假如附近有洗衣房的数据，地图界面上显示红色房子图标，如图3.1

    点击下图2-1最下方最左侧的定位图标，将当前位置红色点移动到页面中央

    点击下图2-1中间图标，进入微信扫码页面，如下右图2-2

    点击下图2-1右侧五角星图标，进入收藏的洗衣房，假如没有收藏的洗衣房，就提醒用户无收藏洗衣房

    Screenshot_20170703-193408.png
    Screenshot_20170703-193408.png

    Screenshot_20170703-194357.png
    Screenshot_20170703-194357.png
    图2-1 图2-2

    扫码后设备立刻开机，手机端进入图2-3页面


    {width="2.5319444444444446in"
    height="4.479166666666667in"}


    F:\projectSource\wxWash\测试\Screenshot_20170703-193322.png
    F:\projectSource\wxWash\测试\Screenshot_20170703-193322.png
    {width="2.5229166666666667in"
    height="4.486111111111111in"}

    图2-3 图2-4

    1：图2-3的中间文字部分显示当前洗衣机所属洗衣点的名字

    2：洗衣机中间部分是模式选择，显示当前使用设备的所有模式，以及各个模式的名称，价格，洗衣时间等信息，点击可选择；不同类型的设备模式信息会不同，手机端显示的模式信息和设备实际的模式信息一一对应即可。

    3：点击模式下方的电话图标栏，会调用手机电话接口，可以联系管理员（当前洗衣点在商户端添加的管理员的联系方式,用户端不需考虑电话来源）

    4：点击"开启筒清洁"右侧的圆形框，可以选择开启筒清洁，开启筒清洁后，洗衣机将会先运行筒清洁模式，提醒用户不要放入衣服，并关好洗衣机门。

    5：点击最下方的生成订单，可以进入图2-4界面，是当前订单详情

    6：点击2-4中的立即支付，调用微信的支付接口，完成支付后提醒支付成功，如图2-5，2-6所示。界面跳转进入订单列表界面。支付成功后洗衣机会自动启动并开始洗衣程序。

    7：假如洗衣机未启动，可以在订单列表点击按钮"开始洗衣"，重新启动洗衣机。

    F:\projectSource\wxWash\测试\Screenshot_20170703-193312.png
    F:\projectSource\wxWash\测试\Screenshot_20170703-193312.png
    {width="2.3895833333333334in"
    height="4.247916666666667in"}


    F:\projectSource\wxWash\测试\Screenshot_20170703-193312.png
    F:\projectSource\wxWash\测试\Screenshot_20170703-193312.png
    {width="2.3895833333333334in"
    height="4.247916666666667in"}

    图2-5 图2-6

    2、预约洗衣
    2.1、功能简述
    预约洗衣的操作过程是，点击屏幕上的洗衣房图标，下方出现该洗衣房的详情简述，点击进入该洗衣房的信息页面，预约对应的机器。

    一个账户最多只能同时预约2台机器

    一个账户每天只能主动取消预约5次（包含超时未验证产生的取消订单），超过限制后当天将不能使用预约功能。

    洗衣机在关机状态下是可以预约的，洗衣机空闲且开机时无法预约，但可通过扫码启动。

    被预约的洗衣机，整机常亮显示"------"。

    当手机发出"响铃"命令时，洗衣机会闪烁显示"------"5s，闪烁频率1Hz，并"发出"滴滴"的蜂鸣音5s。

    2.2、具体操作
    图3.1中红色圆球图标代表当前的位置，红色小房子图标代表当前点附近的洗衣房。图3.2中洗衣机名字旁的蓝色小字代表洗衣机的状态分别为："被预约"，"空闲"，"使用中"，"不能服务"。其中只有当状态为"空闲"时预定按钮是蓝色可点击的，其他的状态的是灰色不可点击的


    {width="2.515277777777778in"
    height="4.472222222222222in"}

    图3.1 图3.2

    1、点击图3.1中的红色小房子，页面下方弹出洗衣房信息

    2、点击图3.1下方的洗衣房信息跳转到图3.2所示的洗衣房洗衣机列表详情。

    3、点击图3.2右上方的五角星可以收藏该洗衣点，一个账号只能收藏一个洗衣点。

    4、点击图3.2中的电话按钮，可联系当前洗衣点的管理员

    5、点击图3.2的预定按钮，假如洗衣机的状态不是"空闲"时，不可预定，预定成功后会提示是否立即验证，假如选择是，可以立即扫码验证。否则可以在"我的订单"里查看该订单，并验证

    3、我的订单
    3.1、功能简述
    从微信的消息窗口点击我的订单，进入订单界面。从支付成功界面也可以进入订单界面。订单分为进行中的订单和已完成订单。其中预约的订单最多只能有两个。不同类型的订单有不同的操作。


    {width="2.8333333333333335in"
    height="5.0368055555555555in"}



    {width="2.8430555555555554in"
    height="5.054166666666666in"}

    图4-1 图4-2

    3.2、具体操作
    订单的具体界面如图4.1和4.2所示，左侧是正在进行中的订单，右侧是已完成的订单，下拉可刷新对应的订单。

    1、预约的订单有"响铃"操作，点击"响铃"洗衣机蜂鸣器会有声音，可以用来寻找预约过的对应的洗衣机

    2、点击"取消订单"，可以取消预约中的订单，洗衣机恢复空闲状态，该订单进入已完成订单列表，显示订单状态为已取消

    3、正在运行中的订单（包含正在洗衣和正在筒清洁的洗衣机）可以点击"强制关机"，强制关机后不会退款，提醒用户等待洗衣机门锁打开后，再打开门，如图4.3,4.4所示。

    4、已完成的订单可以点击"再次使用"，进行洗衣机的预约，预约成功后可以在未完成订单出完成验证。如图4.2所示。

    5、点击"前往支付"，可以对生成订单后未支付的订单重新支付，假如订单已经超时的话，将会支付失败

    6、点击"验证机器"，对自已预约的机器进行验证，假如验证通过则可以开机并跳转到选择模式的界面如图2.3,2.4.


    {width="2.8333333333333335in"
    height="5.0368055555555555in"}



    {width="2.8333333333333335in"
    height="5.0368055555555555in"}

    图4.3 图4.4

    4、消息提醒
    用户在洗衣开始（洗衣机开始运行），筒清洁结束，洗衣机故障，洗衣完成时，均会在公众号消息页面收到消息提醒。提醒的基本信息包括订单编号，订单状态，操作信息；实际的推送信息除了基本信息之外，后续会有随业务需求变化的扩展信息，不作严格要求。

    在洗衣开始是用户会收到洗衣订单的信息提醒，包含订单选择的模式，价格，所在洗衣房的信息

    筒清洁结束会收到一条推送，提醒用户前往洗衣。

    用户在洗衣机故障时会收到故障提醒，提醒用户前往检查洗衣机，如图5.1

    在洗衣完成时，用户会收到洗衣完成的信息提醒，提醒用户前去取衣服，如图5.2

    支付完成的订单，会收到微信支付的信息


    {width="2.6506944444444445in" height="4.7125in"}



    {width="2.6479166666666667in"
    height="4.708333333333333in"}

    图5-1 图5-2

    5、用户反馈
    用户对使用过程中出现的问题进行反馈

    1：反馈类型可以选择不同的问题类型，默认为"洗衣过程"，可以根据实际情况进行选择

    2：问题单号可供选择最近产生的10次，可不选择

    3：可以选择上传两张图片，可以不上传图片

    4：反馈信息，不能为空，并最多200字


    {width="2.701388888888889in"
    height="4.802777777777778in"}



    {width="2.701388888888889in"
    height="4.802777777777778in"}

    商户部分
    1、登录注册
    1.1、登录
    关于账号：一个微信号和一个手机号只能注册一个管理员或者一个运营商。注册账号的微信号和手机号是绑定的，下次登录也必须在注册账号的微信号下登录。

    用户在微信消息页点击我是商户，进入下图的登录页面。初次登陆输入注册账号点击登录即可。

    后续登陆有记住密码功能，默认是勾选上的，下次登录自动填充账号密码，用户直接点击登录即可，默认有效期7天。

    Screenshot_20171031-144656
    Screenshot_20171031-144656
    {width="2.436111111111111in"
    height="4.330555555555556in"}

    1.2、注册
    点击登录页"注册"，进入下图注册界面。
    使用手机号码注册账号，获取验证码，按照提示输入验证码和密码，点击下一步进入角色选择页面。密码栏眼睛按钮点击可查看明文密码。

    选择要注册运营商还是管理员，点击验证进入不同的角色验证页面。

    若在此时没有选择角色信息直接关闭身份验证页面，则默认直接跳转到登录页，再次登录账号会进入该角色选择页。

    Screenshot_2017-08-07-08-36-17
    Screenshot_2017-08-07-08-36-17
    {width="2.4895833333333335in"
    height="4.425in"}


    Screenshot_2017-08-07-08-38-18
    Screenshot_2017-08-07-08-38-18
    {width="2.488888888888889in"
    height="4.425in"}

    1.3、运营商验证
    按照提示输入验证信息。其中电话号码、身份证号、邮箱号有正则验证，填写错误则验证按钮上方会弹出相应错误提示。

    所有填写框必须填完，除了运营商编号无需填写，这个是后台自动分配的。

    点击上传按钮会进入手机相册页面，可选择拍照或者选择已有图片，图片上传成功则会提示上传成功，否则弹出上传失败。

    点击验证，若成功则提示"上传成功，等待验证提示"，1-2个工作日会通过微信消息推送反馈验证结果。

    M6LPT$PX]F6A208V3M~P2RJ
    M6LPT$PX]F6A208V3M~P2RJ
    {width="2.4368055555555554in"
    height="4.330555555555556in"}


    [CZ_LU5[PMC2MVHVO9OS~_G
    [CZ_LU5[PMC2MVHVO9OS~_G
    {width="2.4319444444444445in"
    height="4.330555555555556in"}

    1.4、管理员验证
    按照提示输入验证信息。其中电话号码、身份证号有页面验证，填写错误会弹出相应错误提示。

    所有填写框必须填完，除了分店编号，这个不需要填写，是后台自动分配。

    所属运营商编号是在所属运营商那咨询获取的。

    点击验证，若成功则提示"上传成功，等待验证提示"，1-2个工作日会反馈验证结果，结果会通过微信公众号消息推送告知。

    localhost-63342-iCleaner-traderSys-account-venderVerify.html-_ijt=tr9ibvchjgp1fl2npm2ums3ecd(iPhone
    5)
    localhost-63342-iCleaner-traderSys-account-venderVerify.html-_ijt=tr9ibvchjgp1fl2npm2ums3ecd(iPhone 5)
    {width="2.1104166666666666in" height="4.425in"}

    1.5、忘记密码
    输入手机号获取验证码，按照提示填写验证码，点击下一步。

    输入新密码点击确认，返回登录页重新登录。

    点击图中眼睛图案可查看明文密码。

    Screenshot_2017-08-07-08-41-43
    Screenshot_2017-08-07-08-41-43
    {width="2.488888888888889in"
    height="4.425in"}


    Screenshot_2017-08-07-08-42-06
    Screenshot_2017-08-07-08-42-06
    {width="2.488888888888889in"
    height="4.425in"}

    2、运营商账号
    2.1、运营商主页管理
    主页管理页面展示的信息：设备状态、报表管理、分店数量、支付标准四块信息。

    设备状态：当前运行、空闲、故障、离线四种状态洗衣机的数量。点击右侧箭头进入具体设备页面。

    报表管理：展示当前运营商总收入，用户的程序偏好，洗衣机使用率，点击右侧箭头进入具体收入页面（目前只做收入的具体展示，程序偏好和洗衣机使用率数据只在主页管理页面展示）。

    分店管理：显示当前有多少分店。点击右侧箭头查看具体洗衣分店和洗衣点。

    支付标准展示当前所有机型（目前以设备类型码作为区分），点击进入价格列表界面。

    Screenshot_20171031-114709
    Screenshot_20171031-114709
    {width="2.436111111111111in"
    height="4.330555555555556in"}

    2.2、运营商设备状态
    分别显示当前运行、空闲、故障、离线四种状态的洗衣机的数量。

    每一条信息具体显示当前洗衣机图标，洗衣机的名字、洗衣机uuid、右侧当前洗衣模式。

    输入关键字，点击左侧搜索按钮查询洗衣机，结果应为四种设备状态符合条件的所有洗衣机；点击右侧叉号按钮删除输入文本。

    上拉加载更多，下拉刷新功能。

    点击上方状态栏，则进入对应状态栏。

    点击故障栏每一项信息，下方弹出相应故障代码，洗衣机地址信息。

    Screenshot_2017-08-07-08-43-51
    Screenshot_2017-08-07-08-43-51
    {width="2.488888888888889in"
    height="4.425in"}

    2.3、运营商收入管理
    点击报表管理进入如下页面，展示运营商总收入。

    以洗衣店为列表，每个洗衣店下面展示该洗衣店下面的洗衣点。

    洗衣点显示洗衣点名称，洗衣点下方该洗衣点洗衣机数量，右侧显示洗衣点收入。

    Screenshot_2017-12-04-10-58-44
    Screenshot_2017-12-04-10-58-44
    {width="2.436111111111111in"
    height="4.330555555555556in"}

    2.4、运营商分店管理
    点击分店管理进入如下页面，展示该运营商账号下所有分店信息。

    以洗衣店为列表，每个洗衣店下面展示该洗衣店下面的洗衣点。

    洗衣点显示洗衣点名称，右侧显示该洗衣点洗衣机数量，下方显示该洗衣点电话。

    Screenshot_2017-12-04-10-59-00
    Screenshot_2017-12-04-10-59-00
    {width="2.436111111111111in"
    height="4.330555555555556in"}

    2.5、指定支付标准
    从支付标准入口进入该页面。运营商可自定义收费标准。

    任意点击一种机型进入价格详情页面，该页面展示该种机型下所有价格列表。价格列表只展示该价格组名称。

    点击任意一条价格列表进入价格设置页面。该页面显示该机型可以设置的洗衣模式和当前价格。编辑对应价格点击保存即可修改价格，若成功则提示修改成功，否则提示修改失败。

    Screenshot_20171031-114709
    Screenshot_20171031-114709
    {width="2.4166666666666665in"
    height="4.295833333333333in"}
    Screenshot_20171031-114716
    Screenshot_20171031-114716
    {width="2.4166666666666665in"
    height="4.295833333333333in"}
    Screenshot_20171031-114721
    Screenshot_20171031-114721
    {width="2.4270833333333335in"
    height="4.314583333333333in"}
    2.6、个人信息
    点击主页信息管理左上角个人信息图标进入该页面，此页面显示运营商的注册账户信息。
    Screenshot_20171031-143307
    Screenshot_20171031-143307
    {width="2.436111111111111in"
    height="4.330555555555556in"}

    2.7、消息中心
    点击主页信息管理右上角信息图标（若有消息会以小红点提示），进入个人消息中心，显示账号、设备、店铺、收入信息，每种信息有新的消息时以红色角标显示信息数量。

    点击不同的消息栏可以进入查看信息

    Screenshot_20171031-143316
    Screenshot_20171031-143316
    {width="2.436111111111111in"
    height="3.9868055555555557in"}

    3、管理员账号
    3.1、管理员主页管理
    主页管理页面展示的信息：设备状态、报表管理、分店数量、支付标准四块信息。
    设备状态：当前洗衣店运行、空闲、故障、离线四种状态洗衣机的数量。点击右侧箭头进入具体设备页面。

    报表管理：当前洗衣店总收入，点击右侧箭头进入具体收入页面。程序偏好展示用户最喜欢用的洗衣模式，使用率显示该洗衣店内洗衣机的使用率，程序偏好和使用率不做具体页面展示。

    洗衣房：显示当前有多少洗衣房。点击右侧查看具体洗衣房和洗衣机。

    洗衣机管理：绑定和移除洗衣机。

    主页截图
    主页截图
    {width="2.436111111111111in"
    height="4.330555555555556in"}

    3.2、设备状态
    分别显示当前运行、空闲、故障、离线四种状态的洗衣机。

    每一条信息具体显示当前洗衣机的名字、洗衣机uuid、当前洗衣模式。

    输入关键字，点击左侧搜索按钮查询洗衣机，结果应为四种设备状态符合条件的所有洗衣机；点击右侧叉号按钮删除输入文本。

    上拉加载更多，下拉刷新功能。

    点击上方状态栏，则进入对应状态栏。

    点击故障栏每一项信息，下方弹出相应故障代码，洗衣机地址信息。

    Screenshot_2017-08-07-09-00-16
    Screenshot_2017-08-07-09-00-16
    {width="2.488888888888889in"
    height="4.425in"}

    3.3、洗衣点收入
    显示当前洗衣点的收入，单位为元。

    每条信息左侧显示洗衣点名称，右侧显示洗衣点收入。

    收入截图
    收入截图
    {width="2.436111111111111in"
    height="4.330555555555556in"}

    3.4、洗衣点管理
    显示当前洗衣点下的洗衣点名称及拥有洗衣机数量。

    点击加号进入新建洗衣点界面。

    点击洗衣点条目进入编辑洗衣点界面。

    洗衣房截图
    洗衣房截图
    {width="2.436111111111111in"
    height="4.330555555555556in"}

    3.4.1、新建洗衣点
    填写信息新建洗衣点，点击保存保存洗衣点。

    可直接在地图点击位置信息，会自动填充到所在街道那一栏。

    新建完成后，如果不选择绑定设备，会进入洗衣点详情页

    Screenshot_2017-08-07-08-45-05
    Screenshot_2017-08-07-08-45-05
    {width="2.488888888888889in"
    height="4.425in"}
    C:\Users\Administrator\Desktop\Screenshot_2017-12-04-15-25-54.png
    C:\Users\Administrator\Desktop\Screenshot_2017-12-04-15-25-54.png
    {width="2.4993055555555554in"
    height="4.4432097550306215in"}

    3.4.2、修改洗衣点
    点击详情页右上角编辑按钮，可修改洗衣点信息（洗衣点名称不可修改）
    C:\Users\Administrator\Desktop\Screenshot_2017-12-04-15-26-14.png
    C:\Users\Administrator\Desktop\Screenshot_2017-12-04-15-26-14.png
    {width="2.3125in"
    height="4.111111111111111in"}

    3.5、洗衣机管理
    3.5.1、绑定洗衣机
    选择洗衣机要绑定的洗衣房，扫描洗衣机上的设备二维码，输入验证码，选择绑定到洗衣房。

    此处需要填写楼层信息。


    {width="2.488888888888889in"
    height="4.424305555555556in"}

    3.5.2、移除洗衣机
    扫描要移除洗衣机的二维码，输入验证码，选择移除设备。
    Screenshot_2017-08-07-08-51-39
    Screenshot_2017-08-07-08-51-39
    {width="2.488888888888889in"
    height="4.425in"}

    3.6、个人中心
    点击主页信息管理左上角个人信息图标进入该页面，此页面显示管理员注册账户信息。

    运营商和管理员都有此功能。


    {width="2.8229166666666665in"
    height="5.018055555555556in"}

    3.7、消息中心
    点击主页信息管理右上角信息图标（若有消息会以小红点提示），进入个人消息中心，显示账号、设备、店铺、收入信息。

    点击不同的消息栏可以进入查看信息

    Screenshot_20171031-143316
    Screenshot_20171031-143316
    {width="2.7291666666666665in"
    height="4.465972222222222in"}
    C:\Users\Administrator\Desktop\Screenshot_2017-12-04-15-18-40.png
    C:\Users\Administrator\Desktop\Screenshot_2017-12-04-15-18-40.png
    {width="2.5930555555555554in"
    height="4.484876421697288in"}

    测试部分
    测试部分接口是提供给功能测试以及能效测试人员的特殊接口，不对外开放，每次测试均需要申请，在申请时间内可以测试，过期需要重新申请

    该部分测试功能针对设备功能测试提供，软件（公众号）只提供测试入口，可以使用即可，不要求对体验等方面进行要求测试。

    1、获取测试入口
    公众号聊天对话框输入"我爱格力电器"，返回测试连接，点击该条信息进入测试页面，如下图所示


    {width="2.701388888888889in"
    height="4.802777777777778in"}



    {width="2.701388888888889in"
    height="4.802777777777778in"}

    2、新建测试权限
    点击新建测试权限，在新页面填入信息，提交待审核通过后就可以进行测试。

    1：内部功能测试的申请类型为"内部测试"，

    2：按要求填入名称和手机号，以用来确认测试人员并审核。

    3：选择测试时间段，目前的测试时间最长限制为15天，开始时间为选择当天的0:00,，结束时间为选择时间当天的23:59

    4：点击扫码添加机器，扫描机器二维码，添加到测试列表，可以添加多台设备

    5：点击提交，提交测试申请，等待审核通过


    {width="2.701388888888889in"
    height="4.802777777777778in"}

    3、功能测试测试
    审核通过后，点击下左图中的扫码测试，扫描已经提交过测试申请的机器，进入测试界面

    1：测试选项为提供的测试功能，可以针对整机需要测试选项进行选择:

    2：点击开始测试可以开始测试

    3：需要结束测试时，可以点击强制结束关机


    {width="2.701388888888889in"
    height="4.802777777777778in"}



    {width="2.701388888888889in"
    height="4.802777777777778in"}
    </div>















  </div>
</template>

<script>
  import TableTr from '../../components/Table-tr'
  import {mapState} from 'vuex'
  export default {
    data () {
      return {
        record: []
      }
    },
    created () {
      this.viewDidLoaded()
    },
    components: {
      TableTr
    },
    methods: {
      viewDidLoaded() {
        this.loadRecord()
      },
      loadRecord () {
        $.getScript('../../../static/sources/versionRecord.js', () => {
          console.log("abc" + versionRecord);
          this.record = versionRecord;
        })
      }
    }
  }
</script>

<style lang="scss" scoped>
  * {padding: 5px;}
  .app {margin: 0;padding: 0;text-align: left;font-size: 18px;}
  .center {text-align: center}
  .content_wrapper {background-color:#d2d2d2}
  .menus {
    display: flex;
    flex-direction: column;
    padding-top: 20px;
    * {
      margin: auto;
      color: blue;
    }
  }
  .light_high {text-decoration: underline}







  /*辅助类*/
  .align-center *{text-align: center}

  .margin_10{margin-left: 10px}
  .margin_20{margin-left: 20px}
  .margin_30{margin-left: 30px}
  .margin_40{margin-left: 40px}
  a:link {
    font-size: 15px;
    text-decoration: none;
  }
  a:visited {
    font-size: 15px;
    text-decoration: none;
  }
  a:hover {
    font-size: 15px;
    text-decoration: underline;
  }

</style>
